app/controllers/authors_controller.rb

SELECT  "AUTHORS".* FROM "AUTHORS" WHERE "AUTHORS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 1], ["LIMIT", 1]]
---
    def set_author
      @author = Author.find(params[:id])