app/controllers/books_controller.rb

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "BOOKS" SET "TITLE" = :a1, "DATE_GIVEN" = :a2 WHERE "BOOKS"."ID" = :a3  [["title", "Harry Potter part 1"], ["date_given", Tue, 27 Dec 2016], ["id", 1]]

    def set_book
      @book = Book.find(params[:id])
---
SELECT  "BOOKS".* FROM "BOOKS" WHERE "BOOKS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 1], ["LIMIT", 1]]