app/controllers/journals_controller.rb

  def index
    @journals = Journal.all
---
SELECT "JOURNALS".* FROM "JOURNALS"