app/controllers/users_controller.rb

UPDATE "USERS" SET "BANNED" = :a1 WHERE "USERS"."ID" = :a2  [["banned", false], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 1], ["LIMIT", 1]]
---
  def ban
    id = User.find(params[:format]).id

SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])