app/controllers/workers_controller.rb

  def index
    @workers = Worker.all
---
SELECT * FROM (SELECT  "WORKERS".* FROM "WORKERS" ORDER BY "WORKERS"."ID" DESC ) WHERE ROWNUM <= :a1  [["LIMIT", 1]]

  def edit_salary
    @worker = Worker.last
---
SELECT * FROM (SELECT  "WORKERS".* FROM "WORKERS" ORDER BY "WORKERS"."ID" DESC ) WHERE ROWNUM <= :a1  [["LIMIT", 1]]

  def update_salary
    @worker = Worker.last
---
SELECT * FROM (SELECT  "WORKERS".* FROM "WORKERS" ORDER BY "WORKERS"."ID" DESC ) WHERE ROWNUM <= :a1  [["LIMIT", 1]]

  def update
    begin
      respond_to do |format|
        if @worker.update(worker_params)
---
UPDATE "WORKERS" SET "SALARY" = :a1 WHERE "WORKERS"."ID" = :a2  [["salary", #<BigDecimal:7fcbd006f740,'0.12E2',9(18)>], ["id", 1]]

    def set_worker
      @worker = Worker.find(params[:id])
---
SELECT  "WORKERS".* FROM "WORKERS" WHERE "WORKERS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 3], ["LIMIT", 1]]